Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ИерархияПостов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ИерархияПостов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема/Ext/ObjectModule.bsl
Перем БазоваяШирина;

Процедура ПриЗаписи(Отказ)
	
	//Если Копирование то не пересчитываются свойства при копировании 
	Копирование = ложь;	
	Если ДополнительныеСвойства.Свойство("Копирование") Тогда
		Копирование = ДополнительныеСвойства.Копирование; 
	КонецЕсли;

	// адресация по сотрудникам
	НаборЗаписей = РегистрыСведений.ИА_АдресацияЗадачПланаДействий.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пост.Значение = Ссылка;
	НаборЗаписей.Отбор.Пост.Использование = Истина;
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если не ПометкаУдаления Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ИА_ДанныеФизЛиц.Пользователь
		               |ИЗ
		               |	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
		               |ГДЕ
		               |	ИА_ДанныеФизЛиц.ФизЛицо В(&ФизЛицо)
		               |	И Не ИА_ДанныеФизЛиц.Пользователь = Значение(Справочник.Пользователи.ПустаяСсылка)";

		                                        	
		Запрос.УстановитьПараметр("ФизЛицо", Сотрудники.ВыгрузитьКолонку("ФизЛицо"));
		ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗаписьНабора = НаборЗаписей.Добавить();
			ЗаписьНабора.Пользователь = ВыборкаДетальныеЗаписи.Пользователь;
			ЗаписьНабора.Пост = Ссылка;
		КонецЦикла;
	КонецЕсли;	
	НаборЗаписей.Записать(Истина);
	   
	Если Не Копирование Тогда
		ПроверитьСортировки();
	КонецЕсли;

	// Перезапись вышестоящих (надо для расчета высота и ширины их)
	// если это отдел, то надо пересчитать ширину департамента / если сотрудник, то высоту секции
	Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел ИЛИ ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник ИЛИ ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор Тогда		
		Если Не Копирование Тогда
			РодительОбъект = Родитель.ПолучитьОбъект();
			РодительОбъект.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// проверка наличия физика в связке с юзерами
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ОргСхемаСотрудники.ФизЛицо
	               |ИЗ
	               |	Справочник.ОргСхема.Сотрудники КАК ОргСхемаСотрудники
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
	               |		ПО ОргСхемаСотрудники.ФизЛицо = ИА_ДанныеФизЛиц.ФизЛицо
	               |ГДЕ
	               |	ИА_ДанныеФизЛиц.ФизЛицо ЕСТЬ NULL 
	               |	И ОргСхемаСотрудники.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		мен = РегистрыСведений.ИА_ДанныеФизЛиц.СоздатьМенеджерЗаписи();
		мен.ФизЛицо = Выборка.ФизЛицо;
		мен.Записать();
	КонецЦикла;
	
	//
	НаборИер = РегистрыСведений.КСУ_ИерархияПостов.СоздатьНаборЗаписей();
	НаборИер.Отбор.Пост.Установить(Ссылка,Истина);
	
	ТекРод = Ссылка;
	Пока не ТекРод.Пустая() Цикл
		Новстр = НаборИер.Добавить();
		Новстр.Пост = Ссылка;
		Новстр.Родитель = ТекРод;
		
		ТекРод = ТекРод.Родитель;
	КонецЦикла;
	НаборИер.Записать(истина);
КонецПроцедуры

Процедура ПроверитьСортировки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Родитель = &Родитель
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.ПорядокВСхеме = &ПорядокВСхеме
	               |	И ОргСхема.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Родитель", Родитель);
	Запрос.УстановитьПараметр("ПорядокВСхеме", ПорядокВСхеме);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 0 тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.Родитель = &Родитель
	               |	И ОргСхема.ПометкаУдаления = ЛОЖЬ
	               |	И ОргСхема.ПорядокВСхеме >= &ПорядокВСхеме
	               |	И ОргСхема.Ссылка <> &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОргСхемаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ОргСхемаОбъект.ПорядокВСхеме = ОргСхемаОбъект.ПорядокВСхеме + 1;
		ОргСхемаОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМинимальнуюВысотуБлока(Тест, Ширина, Шрифт)
	Возврат ИА_ОргСхема_Сервер.ПолучитьМинимальнуюВысотуБлока(Тест, Ширина, ЗначениеВСтрокуВнутр(Шрифт));
КонецФункции

Функция ПолучитьМинимальнуюВысотуБлокаИЗаголовка()
	
	Рез = Новый Структура("ВысотаБлока,ВысотаЗаголовка",-1,-1);
	шрифтСотр = ИА_ОргСхема_Сервер.ПолучитьШрифтПодписиСотрудника();
	//Если Шрифт.Получить()<>Неопределено Тогда 
	//	ШрифтЗаголовка = Новый Шрифт(Шрифт.Получить(), , , ложь , Истина, истина);
	//Иначе
	//	ШрифтЗаголовка = Новый Шрифт(, , ложь, Истина, истина);
	//КонецЕсли;
	
	шрифтЭл = Шрифт.Получить();
	Если шрифтЭл<>Неопределено Тогда 
		Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция или ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор ТОгда
			ШрифтЗаголовка = Новый Шрифт(шрифтЭл, , , истина , Истина, истина);
		Иначе
			ШрифтЗаголовка = Новый Шрифт(шрифтЭл, , , шрифтЭл.Полужирный , Истина, истина);
		КонецЕсли;
	Иначе
		ШрифтЗаголовка = Новый Шрифт(, , ложь, Истина, истина);
	КонецЕсли;

		
	сотруд = ИА_ОргСхема_Сервер.ПолучитьПредставлениеСотрудников(ЭтотОбъект);
	парамОрг = ИА_Защита_Оргсхема.ПараметрыОргСхемы();
	ЭМ = парамОрг.ЭМ;
	
	Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель или ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав
		или ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент
		или ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел ТОгда
		
		Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент Тогда
			
			НовШирина = 0;
			
			//если это новый элемент то ссылка пустая, ширина вычисляться неправильно. 
			Если ЗначениеЗаполнено(Ссылка) Тогда
				Выборка = Справочники.ОргСхема.Выбрать(Ссылка);
				Пока Выборка.Следующий() Цикл
					Если Не Выборка.ПометкаУдаления Тогда
						НовШирина = НовШирина + Выборка.Ширина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			Если НовШирина > 0 Тогда
				БазоваяШирина = ?(БазоваяШирина = Неопределено, Ширина, БазоваяШирина); //запоминаем, т.к. ширина потом уменьшится и ее надо вернуть
				Ширина = НовШирина * 0.7; // 0.7 - закладываем коэффициент на случай отображения оргсхемы Отдельно
			КонецЕсли;
		КонецЕсли;
		
		Если Фотографии Тогда
			ТекВысота = Высота;
			итер = 0;
			Пока итер < 10 Цикл
				времШирина = Ширина - ТекВысота*3/4 - 2; 
				Если времШирина <= 0 Тогда
					Рез.ВысотаБлока = -1;
					Прервать;
				КонецЕсли; 
				
				требвысотаГлавная = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, времШирина, Шрифт.Получить());
				требвысотаСотрудн = ПолучитьМинимальнуюВысотуБлока(сотруд, времШирина, шрифтСотр);
				требвысотаСотрудн = требвысотаСотрудн*1.1;
				
				НоваяВысота = требвысотаГлавная + требвысотаСотрудн*2;
				
				времШирина = Ширина - НоваяВысота*3/4 - 2;
				Если времШирина <= 0 Тогда
					Рез.ВысотаБлока = -1;
					Прервать;
				КонецЕсли;
				
				требвысотаГлавная = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, времШирина, Шрифт.Получить());
				требвысотаСотрудн = ПолучитьМинимальнуюВысотуБлока(сотруд, времШирина, шрифтСотр);
				требвысотаСотрудн = требвысотаСотрудн*1.1;
				НоваяВысотаРасчетная = требвысотаГлавная + требвысотаСотрудн*2;
				Если НоваяВысотаРасчетная <= НоваяВысота Тогда
					Рез.ВысотаБлока = НоваяВысотаРасчетная;
					Прервать;
				Иначе
					ТекВысота = НоваяВысотаРасчетная*1.1;
				КонецЕсли;
				
				итер = итер + 1;
			КонецЦикла;
		Иначе
			требвысотаГлавная = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, Ширина, Шрифт.Получить());
					
			требвысотаСотрудн = ПолучитьМинимальнуюВысотуБлока(сотруд, Ширина-2, шрифтСотр);
			требвысотаСотрудн = требвысотаСотрудн*1.1;
			Рез.ВысотаБлока = требвысотаГлавная + требвысотаСотрудн*2; // пост по центру, снизу сотрудники
		КонецЕсли;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция Тогда
		// заголовок		
		Если ЭМ Тогда
			ШрифтЗаголовка = Новый шрифт(ШрифтЗаголовка,,,истина,ложь,ложь);
		КонецЕсли;
		требвысотаЗаголовок = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, Ширина-2, ШрифтЗаголовка);
		требвысотаЗаголовок = требвысотаЗаголовок+2;
		Рез.ВысотаЗаголовка = требвысотаЗаголовок;
		
		// ЦКП
		ТекстЦКП = "ЦКП:" +Символы.ПС+ ЦКП;
		требвысотаЦКП = ПолучитьМинимальнуюВысотуБлока(ТекстЦКП, Ширина-1, Шрифт.Получить());
		
		// Сотрудники
		ВысотаСотр = Константы.ИА_ВысотаПодписиВБлокеСекцияИСотрудник.Получить();
		
		// Подчиненные
		ВысотаПодч = 0;
		Если не ЭтоНовый() Тогда
			Выборка = Справочники.ОргСхема.Выбрать(Ссылка);
			Пока Выборка.Следующий() Цикл
				Если не выборка.ПометкаУдаления Тогда
					ВысотаПодч = ВысотаПодч + Выборка.Высота + 1;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если ЭМ Тогда
			Рез.ВысотаБлока = требвысотаЗаголовок + ВысотаСотр*Сотрудники.Количество() + ВысотаПодч + 6 + парамОрг.ВысотаАдминСекции; 
		Иначе
			Рез.ВысотаБлока = требвысотаЗаголовок + требвысотаЦКП + ВысотаСотр*Сотрудники.Количество() + ВысотаПодч + 3; // 3 на отступы
		КонецЕсли;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор Тогда
		// заголовок
		требвысотаЗаголовок = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, Ширина-2, ШрифтЗаголовка);
		требвысотаЗаголовок = требвысотаЗаголовок+2;
		Рез.ВысотаЗаголовка = требвысотаЗаголовок;
		
		// ЦКП
		ТекстЦКП = "ЦКП:" +Символы.ПС+ ЦКП;
		требвысотаЦКП = ПолучитьМинимальнуюВысотуБлока(ТекстЦКП, Ширина-1, Шрифт.Получить());
		
		// Сотрудники
		ВысотаСотр = Константы.ИА_ВысотаПодписиВБлокеСекцияИСотрудник.Получить();
		
		// Подчиненные
		ВысотаПодч = 0;
		Если не ЭтоНовый() Тогда
			Выборка = Справочники.ОргСхема.Выбрать(Ссылка);
			Пока Выборка.Следующий() Цикл
				Если не выборка.ПометкаУдаления Тогда
					ВысотаПодч = ВысотаПодч + Выборка.Высота;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
				
		Если ЭМ Тогда
			Рез.ВысотаБлока = требвысотаЗаголовок + ВысотаСотр*Сотрудники.Количество() + ВысотаПодч + 4; // 3 на отступы
		Иначе
			Рез.ВысотаБлока = требвысотаЗаголовок + требвысотаЦКП + ВысотаСотр*Сотрудники.Количество() + ВысотаПодч + 3; // 3 на отступы
		КонецЕсли;
	ИначеЕсли ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник Тогда
		// заголовок
		требвысотаЗаголовок = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, Ширина-2, ШрифтЗаголовка);
		Рез.ВысотаЗаголовка = требвысотаЗаголовок;
		
		// Сотрудники
		ВысотаСотр = Константы.ИА_ВысотаПодписиВБлокеСекцияИСотрудник.Получить();
		
		Рез.ВысотаБлока = требвысотаЗаголовок + ВысотаСотр*Сотрудники.Количество() + 1;
	КонецЕсли;
	
	Ширина = ?(БазоваяШирина = Неопределено, Ширина, БазоваяШирина);
	
	Возврат Рез;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	

	Если ДополнительныеСвойства.Свойство("Копирование") Тогда
	    Если ДополнительныеСвойства.Копирование Тогда
			Возврат;	
		КонецЕсли; 
	КонецЕсли;

	Если ПометкаУдаления Тогда 
		Возврат;
	КонецЕсли;
	
	// проверим высоты
	Если ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Организация Тогда
		СтрВысот = ПолучитьМинимальнуюВысотуБлокаИЗаголовка();
		
		Если СтрВысот.ВысотаБлока = -1 Тогда
			Высота = ПолучитьМинимальнуюВысотуБлокаСФотографией();
		Иначе
			Высота = СтрВысот.ВысотаБлока;
		КонецЕсли;
		
		ВысотаЗаголовка = СтрВысот.ВысотаЗаголовка;
		
		// высоты цкп для департамента и отдела
		ТекстЦКП = "ЦКП:" +Символы.ПС+ ЦКП;
		Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел или ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент Тогда
			
			НовШирина1 = Ширина; 
			Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент И ЗначениеЗаполнено(Ссылка) Тогда
				НовШирина1 = 0;
				Выборка = Справочники.ОргСхема.Выбрать(Ссылка);
				Пока Выборка.Следующий() Цикл
					Если Не Выборка.ПометкаУдаления Тогда
						НовШирина1 = НовШирина1 + Выборка.Ширина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;

			ВысотаЦКП = ПолучитьМинимальнуюВысотуБлока(ТекстЦКП, НовШирина1-1, Шрифт.Получить());
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

// Вычисляет высоту блока с фотографией, когда содержимое блока очень велико, размер фото при этом фиксируется
// в размере 33% от ширины блока, оставшиеся 67% отводятся под содержимое
//
Функция ПолучитьМинимальнуюВысотуБлокаСФотографией() 
	
	НоваяВысота = 0;
	
	Сотруд = ИА_ОргСхема_Сервер.ПолучитьПредставлениеСотрудников(ЭтотОбъект);
	ШрифтСотр = ИА_ОргСхема_Сервер.ПолучитьШрифтПодписиСотрудника();
	
	Ширина67 = Ширина * 0.67;
	
	Инд = 0;
	
	Пока Истина Цикл
		
		ТребВысотаГлавная = ПолучитьМинимальнуюВысотуБлока(НаименованиеДляОргсхемы, Ширина67, Шрифт.Получить());
		ТребВысотаСотрудн = ПолучитьМинимальнуюВысотуБлока(Сотруд, Ширина67, ШрифтСотр);
		ТребВысотаСотрудн = ТребВысотаСотрудн * 1.1;
		
		НоваяВысота = (ТребВысотаГлавная + ТребВысотаСотрудн * 2) * (1 + Инд / 10);
		ВремШирина = Ширина67 - НоваяВысота*3/4 - 2;
		
		Если ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел Тогда
			Возврат НоваяВысота;
		КонецЕсли;
		
		Если ВремШирина <= 0 Тогда
			Прервать;
		Конецесли;
		
		Инд = Инд + 1;
		
	КонецЦикла;

	Возврат НоваяВысота;
	
КонецФункции	

БазоваяШирина = Неопределено
